///泡泡排序

///int a[10]={4,5,6, 1,2,3, 7,8,9, 0};///(1)陣列
///int a[10]={0, 3, 2, 1, 4, 5, 6, 7, 8, 9};///快排好的
#include <stdio.h>
int a[10]={9, 8, 7, 6, 5, 4, 3, 2, 1, 0};///worst
int main()
{
    for(int i=0; i<10; i++) printf("%d", a[i]);
    printf("\n");///把陣列印出來觀察

    for(int k=0; k<100; k++){///一直做
        ///原則: 左右比對，順序不對就交換
        for(int i=0; i<10-1; i++){///迴圈怎麼跑
            if( a[i] > a[i+1] ){///(1)反過來想，左大右小就交換
                int temp=a[i];///(3)交換
                a[i]=a[i+1];
                a[i+1]=temp;
            }


        }
        for(int i=0; i<10; i++) printf("%d", a[i]);
        printf("\n");///把陣列印出來觀察

    }
}
